const inputText = prompt("Введіть текст:");

const words = inputText.split(' ');

let charCount = new Map();

for (let i = 0; i < words.length; i++) {
  const word = words[i];

  for (let j = 0; j < word.length; j++) {
    const char = word[j];

    if (charCount.has(char)) {
      charCount.set(char, charCount.get(char) + 1);
    } else {
      charCount.set(char, 1);
    }
  }
}

let uniqueChar = null;

for (const [char, count] of charCount) {
  if (count === 1) {
    uniqueChar = char;
    break;
  }
}

if (uniqueChar) {
  console.log("Перший унікальний символ:", uniqueChar.toLowerCase());
} else {
  console.log("У тексті немає унікальних символів.");
}

/* Логіка коду

1. Зчитування введеного тексту з клавіатури або отримання його з іншого джерела за допомогою prompt.

2. Розділення тексту на окремі слова за допомогою split. Роздільником служить пробіл.

3. Створення порожнього об'єкту charCount, який буде використовуватися для підрахунку кількості входжень кожного символу.

4. Ітерація по кожному слову зі списку words.

5. Для кожного слова, внутрішня ітерація по кожному символу.

6. Перевірка, чи вже існує символ у charCount. Якщо символ вже присутній, збільшується його лічильник на 1. Якщо символ ще не присутній, встановлюється лічильник на 1.

7. По закінченні циклу підрахунку символів, ми отримуємо charCount, де кожен символ тексту з'являється разом з кількістю його входжень у текст.

8. Створення змінної uniqueChar та ініціалізація її значенням null.

9. Ітерація по charCount, використовуючи for...of цикл.

10. Перевірка, чи кількість входжень символу рівна 1. Якщо так, присвоюємо uniqueChar значення поточного символу і припиняємо ітерацію.

11. Виведення результату на екран. Якщо uniqueChar не дорівнює null, виводимо "Перший унікальний символ:" разом з малими літерами uniqueChar. Інакше, виводимо "У тексті немає унікальних символів."

*/







